package ru.utegulov.exam;


/*
фильтр для тиктоков
принимает на вход массив байтов(типо картинку)
к этому массиву байтов применяет набор операций и возвращать измененный массив байтов
операции делятся на типы: для каждого типа задается сколько раз он может встречаться(количество(можно разных) алгоритмов)
если я собираюсь наложить операцию, которая может использоваться один раз, то после этого этот тип операций нельзя использовать
(вытесняет другие)

для разных типов операций могу указать порядок(этот порядок они должны поддерживать)

предоставить инфраструктуру и пример использования (массив байтов увеличить на один, и уменьшить на 1)

 */
public class Filter {

}
